## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:26" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:26" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 26 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "d2d7e68fc69a7510ebb7aa4bd00785eb-6" -> "a02685c7d2575596c536a1407c6ff142"
      ~ id                     = "graphql.1cbb23ad69ad38acfcd8dbd240d87c6d.zip" -> (known after apply)
      ~ key                    = "graphql.1cbb23ad69ad38acfcd8dbd240d87c6d.zip" -> "graphql.a02685c7d2575596c536a1407c6ff142.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "1cbb23ad69ad38acfcd8dbd240d87c6d" -> "a02685c7d2575596c536a1407c6ff142"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "6A5QYjnpn9HJHzjH94KYkb5UL1fsamRj" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "78c53788f8f4350bd4eefb31430eab61" -> "18d06148db23d6e5ed9278f4e7f94a9b"
        id                     = "dist/200.html"
      ~ source_hash            = "78c53788f8f4350bd4eefb31430eab61" -> "18d06148db23d6e5ed9278f4e7f94a9b"
        tags                   = {}
      ~ version_id             = "vN2MVbsocmbDF9NwCNgwhEh9RbPS8yoC" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "6685e6dbc0c779208a00f604644bf4dc" -> "4589bd195f699025101dbc44d98432cc"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "6685e6dbc0c779208a00f604644bf4dc" -> "4589bd195f699025101dbc44d98432cc"
        tags                   = {}
      ~ version_id             = "0SIoJYQjeWipp5NPQOcqv1SCubMGw9TC" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "d8763584f902751d7747684da6cea750" -> "f048e0c8e273ca180f64015fd589e1b2"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "d8763584f902751d7747684da6cea750" -> "f048e0c8e273ca180f64015fd589e1b2"
        tags                   = {}
      ~ version_id             = "MFCsFbmo1sQVJUEyD2PzmZw4PCWPvauD" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "78c53788f8f4350bd4eefb31430eab61" -> "18d06148db23d6e5ed9278f4e7f94a9b"
        id                     = "dist/index.html"
      ~ source_hash            = "78c53788f8f4350bd4eefb31430eab61" -> "18d06148db23d6e5ed9278f4e7f94a9b"
        tags                   = {}
      ~ version_id             = "J1QED.ygy4grngkVk7URZde9bvBCaX7G" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.8e988fab.js"] will be destroyed
  # (because key ["static/js/app.8e988fab.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "85f4b6ae5c78d01d322de254a80047dd" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.8e988fab.js" -> null
-       key                    = "dist/static/js/app.8e988fab.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.8e988fab.js" -> null
-       source_hash            = "85f4b6ae5c78d01d322de254a80047dd" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "lBramqdWa3xSdZoNZXZs52v4YUWor7We" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.8e988fab.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.8e988fab.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "22534f5b586cb736e9cdf4c0742c3fd1" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.8e988fab.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.8e988fab.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.8e988fab.js.LICENSE.txt" -> null
-       source_hash            = "22534f5b586cb736e9cdf4c0742c3fd1" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "AJZu3YyeiNQyfoW5EUtL37GPpIpc_mkM" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.f58d0aad.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "d2b1b1329bdc247f8b11f0e941312a0a"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.f58d0aad.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.f58d0aad.js"
+       source_hash            = "d2b1b1329bdc247f8b11f0e941312a0a"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.f58d0aad.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "22534f5b586cb736e9cdf4c0742c3fd1"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.f58d0aad.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.f58d0aad.js.LICENSE.txt"
+       source_hash            = "22534f5b586cb736e9cdf4c0742c3fd1"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.lambda_function-graphql.aws_iam_policy.additional_inline[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_inline" {
        id        = "arn:aws:iam::357150818708:policy/cpfreporter-graphql-inline"
        name      = "cpfreporter-graphql-inline"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = "kms:Decrypt"
                        Effect   = "Allow"
                        Resource = "arn:aws:kms:us-west-2:357150818708:key/df1661b4-62e5-4668-8e39-f872c9acfceb"
                        Sid      = "DecryptPostgresSecret"
                    },
+                   {
+                       Action   = "secretsmanager:GetSecretValue"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:secretsmanager:us-west-2:357150818708:secret:cpfreporter-passage_api_key-JCnrb7"
+                       Sid      = "GetPassageAPIKeySecretValue"
                    },
                    {
                        Action   = [
                            "ssm:GetParameters",
                            "ssm:GetParameter",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:ssm:us-west-2:357150818708:parameter/cpfreporter/postgres/master_password"
                        Sid      = "GetPostgresSecret"
                    },
                    # (1 unchanged element hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2023-12-21T17:23:47.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:42" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:42/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.1cbb23ad69ad38acfcd8dbd240d87c6d.zip" -> "graphql.a02685c7d2575596c536a1407c6ff142.zip"
        tags                           = {}
      ~ version                        = "42" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "7030b9f5535e75b78e9ba9041839bb72c3ad4a21" -> "40e2d9efa56b7ba513fc8f3f659b18d6961890bc"
              ~ "DD_TAGS"                            = "git.commit.sha:7030b9f5535e75b78e9ba9041839bb72c3ad4a21,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:40e2d9efa56b7ba513fc8f3f659b18d6961890bc,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "7030b9f5535e75b78e9ba9041839bb72c3ad4a21" -> "40e2d9efa56b7ba513fc8f3f659b18d6961890bc"
+               "PASSAGE_API_KEY_SECRET_ARN"         = (sensitive value)
                # (15 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "42" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 5 to add, 7 to change, 5 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/7296420466)*